import { EngineButton } from '../Button'
import './styles.scss'

export const AlertModalContent = () => {
	return (
		<div className="alert-modal">
			<div className="alert-modal__icon-wrapper">
				<svg className="alert-modal__icon" width="46" height="42" viewBox="0 0 46 42" fill="none">
					<g clipPath="url(#clip0_25_991)">
						<path
							d="M46 38.0234C46 39.0979 45.6211 39.9176 44.8634 40.4825C44.1057 41.0473 43.1758 41.3297 42.0737 41.3297H3.92633C2.8242 41.3297 1.89428 41.0404 1.13657 40.4618C0.378856 39.8832 0 39.0704 0 38.0234C0 37.1968 0.247978 36.3564 0.743935 35.5022L19.7969 2.27314C20.7062 0.757712 21.7808 0 23.0207 0C24.2606 0 25.3076 0.757712 26.1617 2.27314L45.2561 35.5436C45.752 36.4253 46 37.2519 46 38.0234ZM25.8724 16.9039V10.8697H20.1276V16.9039C20.1276 17.2896 20.1551 17.6547 20.2102 17.9991C20.2653 18.3435 20.3411 18.7293 20.4376 19.1563C20.534 19.5834 20.6098 19.9485 20.6649 20.2516L21.7394 26.947H24.1779L25.2938 20.2516C25.3489 19.976 25.4316 19.6178 25.5418 19.177C25.652 18.7361 25.7346 18.3435 25.7898 17.9991C25.8449 17.6547 25.8724 17.2896 25.8724 16.9039ZM25.8724 32.8985C25.8724 32.0994 25.59 31.4244 25.0252 30.8733C24.4603 30.3223 23.7784 30.0467 22.9793 30.0467C22.2078 30.0467 21.5397 30.3223 20.9748 30.8733C20.41 31.4244 20.1276 32.0994 20.1276 32.8985C20.1276 33.6975 20.41 34.3795 20.9748 34.9443C21.5397 35.5091 22.2078 35.7916 22.9793 35.7916C23.7784 35.7916 24.4603 35.5091 25.0252 34.9443C25.59 34.3795 25.8724 33.6975 25.8724 32.8985Z"
							fill="#FC5353"
						/>
					</g>
					<defs>
						<clipPath id="clip0_25_991">
							<rect width="46" height="41.3297" fill="white" />
						</clipPath>
					</defs>
				</svg>
			</div>

			<h4 className="alert-modal__title">Вы действительно хотите завершить тестирование?</h4>

			<div className="alert-modal__actions">
				<EngineButton variant="third" className="alert-modal__button">
					Да
				</EngineButton>
				<EngineButton variant="secondary" className="alert-modal__button">
					Отмена
				</EngineButton>
			</div>
		</div>
	)
}
